# Задача №4
# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали 
# одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?

s = int(input('Какое колличество журавликов сделали дети втроём? '))
print('Петя и Сережа сделали по', s//4, 'шт')
print('А Маша сделала', s//2, 'шт')